#include "headEscape.h"

void animation_intro()
{
	// E1 소실
	system("cls");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 10);
	printf(" \n\n");
	printf("               #########    #########     ########     ########     #########   ### \n");
	printf("               ###          ###          ###     ###   ###    ###   ###          ### \n");
	printf("                ###          ###          ###     ###   ###    ###   ###          ### \n");
	printf("                  ########    ###          ###########   #########    ##########   ### \n");
	printf("                         ###   ###          ###     ###   ###          ###              \n");
	printf("                          ###   ###          ###     ###   ###          ###          ### \n");
	printf("                    #########     #########   ###     ###   ###           #########   ### \n");
	Sleep(200); // 작업대기
	// S 소실
	system("cls");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 11);
	printf(" \n\n");
	printf("  #########                 #########     ########     ########     #########   ### \n");
	printf("  ###                       ###          ###     ###   ###    ###   ###          ### \n");
	printf("   ###                       ###          ###     ###   ###    ###   ###          ### \n");
	printf("    ##########                ###          ###########   #########    ##########   ### \n");
	printf("     ###                       ###          ###     ###   ###          ###              \n");
	printf("      ###                       ###          ###     ###   ###          ###          ### \n");
	printf("        #########                 #########   ###     ###   ###           #########   ### \n");
	Sleep(200);
	// C 소실
	system("cls");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 10);
	printf(" \n\n");
	printf("  #########    #########                  ########     ########     #########   ### \n");
	printf("  ###          ###                       ###     ###   ###    ###   ###          ### \n");
	printf("   ###          ###                       ###     ###   ###    ###   ###          ### \n");
	printf("    ##########    ########                 ###########   #########    ##########   ### \n");
	printf("     ###                 ###                ###     ###   ###          ###              \n");
	printf("      ###                 ###                ###     ###   ###          ###          ### \n");
	printf("        #########   #########                 ###     ###   ###           #########   ### \n");
	Sleep(200);
	// A 소실
	system("cls");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 11);
	printf(" \n\n");
	printf("  #########    #########    #########                  ########     #########   ### \n");
	printf("  ###          ###          ###                        ###    ###   ###          ### \n");
	printf("   ###          ###          ###                        ###    ###   ###          ### \n");
	printf("    ##########    ########    ###                        #########    ##########   ### \n");
	printf("     ###                 ###   ###                        ###          ###              \n");
	printf("      ###                 ###   ###                        ###          ###          ### \n");
	printf("        #########   #########     #########                 ###           #########   ### \n");
	Sleep(200);
	// P 소실
	system("cls");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 10);
	printf(" \n\n");
	printf("  #########    #########    #########     ########                  #########   ### \n");
	printf("  ###          ###          ###          ###     ###                ###          ### \n");
	printf("   ###          ###          ###          ###     ###                ###          ### \n");
	printf("    ##########    ########    ###          ###########                ##########   ### \n");
	printf("     ###                 ###   ###          ###     ###                ###              \n");
	printf("      ###                 ###   ###          ###     ###                ###          ### \n");
	printf("        #########   #########     #########   ###     ###                 #########   ### \n");
	Sleep(200);
	// E2 소실
	system("cls");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 11);
	printf(" \n\n");
	printf("  #########    #########    #########     ########     ########                 ### \n");
	printf("  ###          ###          ###          ###     ###   ###    ###                ### \n");
	printf("   ###          ###          ###          ###     ###   ###    ###                ### \n");
	printf("    ##########    ########    ###          ###########   #########                 ### \n");
	printf("     ###                 ###   ###          ###     ###   ###                           \n");
	printf("      ###                 ###   ###          ###     ###   ###                       ### \n");
	printf("        #########   #########     #########   ###     ###   ###                       ### \n");
	Sleep(200);
	// ! 소실
	system("cls");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 7);
	printf(" \n\n");
	printf("  #########    #########    #########     ########     ########     #########       \n");
	printf("  ###          ###          ###          ###     ###   ###    ###   ###              \n");
	printf("   ###          ###          ###          ###     ###   ###    ###   ###              \n");
	printf("    ##########    ########    ###          ###########   #########    ##########       \n");
	printf("     ###                 ###   ###          ###     ###   ###          ###              \n");
	printf("      ###                 ###   ###          ###     ###   ###          ###              \n");
	printf("        #########   #########     #########   ###     ###   ###           #########       \n");
	Sleep(200);
	// 모두롤백
	system("cls");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 7);
	printf(" \n\n");
	printf("  #########    #########    #########     ########     ########     #########   ### \n");
	printf("  ###          ###          ###          ###     ###   ###    ###   ###          ### \n");
	printf("   ###          ###          ###          ###     ###   ###    ###   ###          ### \n");
	printf("    ##########    ########    ###          ###########   #########    ##########   ### \n");
	printf("     ###                 ###   ###          ###     ###   ###          ###              \n");
	printf("      ###                 ###   ###          ###     ###   ###          ###          ### \n");
	printf("        #########   #########     #########   ###     ###   ###           #########   ### \n");
	Sleep(500);
	system("cls");

	return 0;
}